In [4]:
import pandas as pd
import numpy as np

df = pd.read_csv('train.csv')
df.head()

# df.duplicated()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   name      891 non-null    object
 3   sex       891 non-null    object
 4   age       714 non-null    float64
 5   sibsp     891 non-null    int64
 6   parch     891 non-null    int64
 7   ticket    891 non-null    object
 8   fare      891 non-null    float64
 9   cabin     204 non-null    object
 10  embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 76.7+ KB

In [7]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [8]:
cat_col = [col for col in df.columns if df[col].dtype == 'object']
print('Categorical Columns : ', cat_col)

num_col = [col for col in df.columns if df[col].dtype != 'object']
print('Numerical Columns : ', num_col)

Categorical Columns :  ['name', 'sex', 'ticket', 'cabin', 'embarked']
Numerical Columns :  ['survived', 'pclass', 'age', 'sibsp', 'parch', 'fare']

In [9]:
df[cat_col].nunique()

name        891
sex           2
ticket      681
cabin       147
embarked      3
dtype: int64

pd.read_csv(filepath_or_buffer, sep=',', header='infer', index_col=None, usecols=None, engine=None, skiprow=None, nrows=None)

filepath_or_buffer = CSV location or URL
sep = separator, "," is default
header = list of int to show as column names
usecols = retrieves only selected cols from CSV
nrows = number of rows to display
index_col = displays index numbers along with records
skiprows = skips passed rows in the new data frame

In [11]:
import pandas as pd

df = pd.read_csv("people-100.csv",
                 nrows = 5,
                 header=0,
                 index_col=['Sex', 'Job Title'],
                usecols=['Sex', 'Job Title', 'Email'])
# print(df.head())
print(df)

                                                Email
Sex    Job Title
Male   Games developer           elijah57@example.net
Female Phytotherapist           bethany14@example.com
Male   Homeopath                bthompson@example.com
       Market researcher    kaitlinkaiser@example.com
       Veterinary surgeon  buchananmanuel@example.net